Repository: autohotkey-docs-translation/v2-ja
Catalog: omegat/project_save.tmx
Source language: en
Languages: ja

source: For example, using the mouse wheel as a prefix in a hotkey such as WheelDown & Enter is not supported.
ja: 例えば、WheelDown & Enterのようなホットキーの接頭辞としてマウスホイールを使用することはサポートされていません。

source: For example, v1.01 = v1.1, but a20 > a112.
ja: 例えば、v1.01＝v1.1ですが、a20＞a112です。

source: For example, v1.1.33-alpha is the same as v1.1.33.00-alpha.0.
ja: 例えば、v1.1.33-alpha は v1.1.33.00-alpha.0 と同じです。

source: For example, values without a Call method cannot be called or passed to SetTimer, while values without either an __Enum method or a Call method cannot be passed to For.
ja: 例えば、Callメソッドを持たない値はSetTimerに呼び出したり渡したりすることができず、__EnumメソッドもCallメソッドも持たない値はForに渡すことができません。

source: For example, vk07 was once undefined and safe to use, but since Windows 10 1909 it is reserved for opening the game bar.
ja: 例えば、かつてvk07は未定義で使っても問題ありませんでしたが、Windows 10 ビルド1909以降、ゲームバーを開くために予約されるようになりました。

source: For example, when -1 is sent as a UInt, it would become 0xFFFFFFFF.
ja: 例えば、-1をUIntとして送信した場合、0xFFFFFFFとなります。

source: For example, when "A|B|A" is sorted randomly, the result could contain either one or two A's.
ja: 例えば、"A|B|A"がランダムにソートされた場合、結果には1つまたは2つのAが含まれる可能性があります。

source: For example, when used with a Scripting.Dictionary object, each Value1 contains a key from the dictionary and Value2 is typically 8 for strings and 3 for integers.
ja: 例えば、Scripting.Dictionaryオブジェクトで使用する場合、各Value1には辞書のキーが含まれ、Value2は通常、文字列の場合は8、整数の場合は3です。

source: For example, when using Xbox Wireless/360 controllers, JoyX/JoyY is the left stick, JoyR/JoyU the right stick, JoyZ the left and right triggers, and JoyPOV the directional pad (D-pad).
ja: 例えば、Xbox Wireless/360コントローラーを使用する場合、JoyX/JoyYは左スティック、JoyR/JoyUは右スティック、JoyZは左右のトリガー、JoyPOVは方向パッド（Dパッド）となります。

source: For example, when you hold down a hotkey whose #MaxThreadsPerHotkey setting is 1 (the default), incoming keypresses are ignored if that hotkey subroutine is already running.
ja: たとえば、#MaxThreadsPerHotkeyの設定が1（デフォルト）のホットキーを押し続けているとき、そのホットキーサブルーチンがすでに実行されていると、キー入力は無視されます。

source: For example, whenever an address is copied via something like x := address, ObjAddRef should be called.
ja: 例えば、x := addressのようにアドレスがコピーされるときは、必ずObjAddRefが呼ばれなければならない。

source: For example, with a DPI of 144 (150%), MyGui.Show("w100") would make the Gui 150 (100 * 1.5) pixels wide, and resizing the window to 200 pixels wide via the mouse or WinMove would cause MyGui.GetClientPos(,,&W) to set W to 133 (200 // 1.5).
ja: 例えば、DPIが144（150％）の場合、MyGui.Show("w100")でGuiを150（100 * 1.5）ピクセル幅にし、マウスやWinMoveでウィンドウを200ピクセル幅にリサイズするとMyGui.GetClientPos(,,&W)でWに133（200 // 1.5）設定します。

source: For example, with a DPI of 144 (150 %), MyGui.Show("w100") would make the Gui 150 (100 * 1.5) pixels wide, and resizing the window to 200 pixels wide via the mouse or WinMove would cause MyGui.GetClientPos(,,&W) to set W to 133 (200 // 1.5).
ja: 例えば、DPIが144（150 %）の場合、MyGui.Show("w100")でGuiを150（100 * 1.5）ピクセル幅にし、マウスやWinMoveでウィンドウを200ピクセル幅にリサイズするとMyGui.GetClientPos(,,&W)でWに133（200 // 1.5）設定します。

source: For example, with an array of 3 items, Index must be between -3 and 4, inclusive.
ja: 例えば、3つの項目からなる配列の場合、Indexは-3から4までの間でなければならない。

source: For example, you could specify "ahk_pid" PID instead of "ahk_pid " PID.
ja: 例えば、"ahk_pid " PIDの代わりに"ahk_pid" PIDを指定することができる。

source: For example:
ja: 事例：

source: For example: "Untitled ahk_class Notepad".
ja: 事例："Untitled ahk_class Notepad"。

source: For example: 200453.
ja: 事例：200453。

source: For example: 2005
ja: 事例：2005

source: For example: "&Open"
ja: 事例："&Open"

source: For example: "," would divide the string based on every occurrence of a comma.
ja: 事例：","は、カンマが出現するたびに文字列を分割する。

source: For example: "MyDLL\MyFunction" (the file extension ".dll" is the default when omitted).
ja: 事例："MyDLL\MyFunction"（ファイル拡張子「.dll」は省略時のデフォルトです）。

source: For example: "On B0".
ja: 事例："On B0"。

source: For example: "Untitled ahk_class Notepad ahk_pid " notepad_pid.
ja: 事例："Untitled ahk_class Notepad ahk_pid " notepad_pid。

source: For example: "`n UTF-8"
ja: 事例："`n UTF-8"

source: For example: "`n m5000 UTF-8"
ja: 事例："`n m5000 UTF-8"

source: For example: ',' (a comma) would divide the string based on every occurrence of a comma.
ja: 事例：','（カンマ）は、カンマが出現するたびに文字列を分割することになります。

source: For example: ( LTrim Join|.
ja: 事例：( LTrim Join|。

source: For example: 0x9d6346.
ja: 事例：0x9d6346。

source: For example: FileSetAttrib "-R", "C:\My File.txt".
ja: 事例：FileSetAttrib "-R", "C:\My File.txt"。

source: For example: OnMessage(0x0053, WM_HELP).
ja: 事例：OnMessage(0x0053, WM_HELP)。

source: For example: C:\Windows
ja: 事例：C:\Windows

source: For example: ControlSetStyle("+0x80") or ControlSetStyle("^" StylesToToggle).
ja: 事例：ControlSetStyle("+0x80")またはControlSetStyle("^" StylesToToggle)。

source: For example: HotIf or HotIfWinActive.
ja: 事例：HotIf または HotIfWinActive。

source: For example: Hotkey "#z", my_hotkey_sub, "I1"
ja: 例:Hotkey "#z", my_hotkey_sub, "I1"

source: For example: Hotstring "T".
ja: 事例：Hotstring "T"。

source: For example: IsSet(MyVar).
ja: 事例：IsSet(MyVar)。

source: For example: Loop Files "*.txt", "R" {.
ja: 事例：Loop Files "*.txt", "R" {。

source: For example: Loop Read InputFile, OutputFile {.
ja: 事例：Loop Read InputFile, OutputFile {。

source: For example: Loop Reg "HKLM\Software\AutoHotkey", "V" {.
ja: 事例：Loop Reg "HKLM\Software\AutoHotkey", "V" {。

source: For example: MouseClickDrag "X1", 0, 0, 10, 10.
ja: 事例：MouseClickDrag "X1", 0, 0, 10, 10。

source: For example: MyGui.Opt("+Resize -MaximizeBox").
ja: 事例：MyGui.Opt("+Resize -MaximizeBox")。

source: For example: NumPut("ptr", a, "int", b, "int", c, addrOrBuffer, offset).
ja: 事例：NumPut("ptr", a, "int", b, "int", c, addrOrBuffer, offset)。

source: For example: Run "*Compile " A_ScriptFullPath.
ja: 事例：Run "*Compile " A_ScriptFullPath。

source: For example: Run "explore " A_ProgramFiles.
ja: 事例：Run "explore " A_ProgramFiles。

source: For example: Run "find D:\"
ja: 事例：Run "find D:\"

source: For example: Send "{vkFFsc159}".
ja: 事例：Send "{vkFFsc159}"。

source: For example: TraySetIcon "Shell32.dll", 174.
ja: 事例：TraySetIcon "Shell32.dll", 174。

source: For example: VarSetStrCapacity(&MyVar, 1000).
ja: 事例：VarSetStrCapacity(&MyVar, 1000)。

source: For example: WinSetStyle("+0x80") or WinSetStyle("^" StylesToToggle).
ja: 事例：WinSetStyle("+0x80")またはWinSetStyle("^" StylesToToggle)。

source: For example: cBlue s12 bold.
ja: 事例：cBlue s12 bold。

source: For example: not x:=y is evaluated as not (x:=y).
ja: 事例：not x:=yはnot (x:=y)と評価される。

source: For example: while x < y {.
ja: 事例：while x < y {。

source: For example: {%nameVar%: valueVar}.
ja: 事例：{%nameVar%: valueVar}。

source: For example: !x or !(y and z).
ja: 事例：!x or !(y and z)。

source: For example: "Cdecl Str".
ja: 事例："Cdecl Str"。

source: For example: #Hotstring r s k0 c0.
ja: 事例：#Hotstring r s k0 c0。

source: For example: #Include "*i SpecialOptions.ahk".
ja: 事例：#Include "*i SpecialOptions.ahk"。

source: For example: #x::ExitApp.
ja: 事例：#x::ExitApp。

source: For example: SetNumLockState "AlwaysOn".
ja: 事例：SetNumLockState "AlwaysOn"。

source: For example: TraySetIcon("MyIcon.ico").
ja: 事例：TraySetIcon("MyIcon.ico")。

source: For example: LV.Opt("+Report").
ja: 事例：LV.Opt("+Report")。

source: For example: Loop(2)
ja: 事例：Loop(2)

source: For example: MouseClick "X1".
ja: 事例：MouseClick "X1"。

source: For example: MyGui.Show("AutoSize Center").
ja: 事例：MyGui.Show("AutoSize Center")。

source: For example: MyGui.Show("xCenter y0").
ja: 事例：MyGui.Show("xCenter y0")。

source: For example: WinSetRegion "50-0 w200 h250 E".
ja: 事例：WinSetRegion "50-0 w200 h250 E"。

source: For example: break("outer")
ja: 例: break("outer")

source: For example: continue("outer")
ja: 例： continue("outer")

source: For example: q3.
ja: 事例：q3。

source: For example: s12 (specify decimal, not hexadecimal)
ja: 事例：s12（16進数ではなく、10進数を指定します）

source: For example: v2.0-.
ja: 事例：v2.0-。

source: For example: w600 (specify decimal, not hexadecimal)
ja: 事例：w600（16進数ではなく10進数で指定してください）

source: For example: while x < y.
ja: 事例：while x < y。

source: For example: x <= 3 or x >= 10.
ja: 事例：x <= 3 or x >= 10。

source: For example: x > 3 and x < 10.
ja: 事例：x > 3 and x < 10。

source: For example: x:=1, y+=2, ++index, MyFunc().
ja: 事例：x:=1, y+=2, ++index, MyFunc()。

source: For example: {Enter} and {Space}.
ja: 事例：{Enter}と{Space}。

source: For example: "X55 Y33".
ja: 事例："X55 Y33"。

source: For example: %'novar'% ??
ja: 事例：%'novar'% ??

source: For example: %'novar'% ?? 42.
ja: 事例：%'novar'% ?? 42。

source: For example: MyGui.Show("Hide x55 y66 w300 h200").
ja: 事例：MyGui.Show("Hide x55 y66 w300 h200")。

source: For example: OutDir := StrReplace(OutDir, "%WinDir%", A_WinDir)
ja: 事例：OutDir := StrReplace(OutDir, "%WinDir%", A_WinDir)

source: For example: RControl & RShift::AltTab.
ja: 事例：RControl & RShift::AltTab。

source: For example: WinSetTransColor "EEAA99 150".
ja: 事例：WinSetTransColor "EEAA99 150"。

source: For example: for x, y in z {.
ja: 事例：for x, y in z {。

source: For example: h200.
ja: 事例：h200。

source: For example: static X:=0, Y:="fox".
ja: 事例：static X:=0, Y:="fox"。

source: For example: w200.
ja: 事例：w200。

source: For example: I1.
ja: 事例：I1。

source: For example: T5.
ja: 事例：T5。

source: For example: Var := Trim(Var)
ja: 事例：Var := Trim(Var)

source: For example: 'She said, "An apple a day."'.
ja: 事例：'She said, "An apple a day."'。

source: For example: "w80 h50", "w48 h-1" or "w48" (preserve aspect ratio), "h0 w100" (use original height but override width).
ja: 事例："w80 h50"、"w48 h-1"または"w48"（縦横比を維持）、"h0 w100"（元の高さを使用し、幅をオーバーライド）。

source: For example: Var := unset, Var1 := (Var2?).
ja: 事例：Var := unset、Var1 := (Var2?)。

source: For example: {%NameVar%: ValueVar}.
ja: 例えば：{%NameVar%: ValueVar}。

source: For example: MyGui.Add("Text", "cRed", "My Text").
ja: 事例：MyGui.Add("Text", "cRed", "My Text")。

source: For example: x+-10.
ja: 事例：x+-10。

source: For example: ACDEZ.
ja: 事例：ACDEZ。

source: For example: C:
ja: 事例：C:

source: For example: C:\MYDOCU~1\ADDRES~1.txt.
ja: 事例：C:\MYDOCU~1\ADDRES~1.txt。

source: For example: C:\My Documents.
ja: 事例：C:\My Documents。

source: For example: C:\My Folder
ja: 事例：C:\My Folder

source: For example: C:\Program Files\AutoHotkey\AutoHotkey.exe
ja: 事例：C:\Program Files\AutoHotkey\AutoHotkey.exe

# For example: C:WINDOWSsystem32 otepad.exe
source: For example: C:\WINDOWS\system32\notepad.exe
ja: 事例：C:\WINDOWS\system32\notepad.exe

# For example: C:WindowsSystem32 otepad.exe.
source: For example: C:\Windows\System32\notepad.exe.
ja: 事例：C:\Windows\System32\notepad.exe。

# For example: C:Windows otepad.exe.
source: For example: C:\Windows\notepad.exe.
ja: 事例：C:\Windows\notepad.exe。

source: For example: Hold down Numpad0 and press Numpad1 to launch a hotkey (Numpad0 & Numpad1::); hold down CapsLock and press another key, or click a mouse button (CapsLock & RButton::).
ja: 事例：Numpad0を押しながらNumpad1を押すとホットキーが起動し（Numpad0 & Numpad1::）、CapsLockを押しながら他のキーを押すか、マウスボタンをクリックする（CapsLock & RButton::）。

source: For example: a position on the screen, with X and Y properties; a contact in an address book, with Name, PhoneNumber, EmailAddress and so on.
ja: 事例：XとYのプロパティを持つ画面上の位置、Name、PhoneNumber、EmailAddressなどのプロパティを持つアドレス帳の連絡先です。

source: For example: b is B and 5 is 5.
ja: 事例：b は B で、5 は 5です。

source: For example: notepad.exe.
ja: 事例：notepad.exe。

source: For example: {F12} is F12.
ja: 事例：{F12} は F12。

source: For example: {Numpad5} is 5.
ja: 事例：{Numpad5} は 5。

source: For examples of using GetKeyState with a joystick, see the joystick remapping page and the Joystick-To-Mouse script.
ja: ジョイスティックでGetKeyStateを使う例については、ジョイスティックのリマッピングページと Joystick-To-Mouseスクリプトを参照してください。

source: For flexibility, OnMessage does not make the script automatically persistent.
ja: 柔軟性を持たせるため、OnMessageはスクリプトを自動的に永続化させません。

source: For floating point numbers, the maximum value is generally excluded.
ja: 浮動小数点数のときは、通常、最大値は除かれます。

source: For full detail, see Nested Functions.
ja: 詳しくは、「ネストされた関数」をご覧ください。

source: For full technical details of changes, refer to GitHub.
ja: 変更点の技術的な詳細については、GitHubを参照してください。

source: For further assistance, post on the forums.
ja: さらに詳しいサポートが必要な場合は、フォーラムに投稿してください。

source: For further details, see Component (Sound Functions).
ja: 詳しくは「Component（Sound関数）」をご覧ください。

source: For further details, see Device (Sound Functions).
ja: 詳しくはDevice（Sound関数）をご覧ください。

source: For further explanation, see String Encoding.
ja: 詳しい説明は、「文字列のエンコード」をご覧ください。

source: For further reading, see Hotkeys.
ja: 詳しくは、「ホットキー」をご覧ください。

source: For general RegEx examples, see the RegEx Quick Reference.
ja: 一般的なRegExの例については、RegExクイックリファレンスをご覧ください。

source: For greater selectivity, use #HotIf.
ja: より選択性を高めたい場合は、#HotIfをご利用ください。

source: For help finding or configuring other editors, try the Editors sub-forum.
ja: 他のエディターの検索や設定については、Editorsのサブフォーラムをご覧ください。

source: For historical reasons, the following button and control names begin with Joy, which stands for joystick.
ja: 歴史的な理由から、以下のボタンとコントロールの名前はジョイスティックの略であるJoyで始まる。

source: For immutable values this distinction isn't important, but objects can have mutable properties.
ja: 不変の値の場合はこの区別は重要ではありませんが、オブジェクトは変幻自在のプロパティを持つことができます。

source: For information about other objects which can be called like functions, see Function Objects.
ja: 関数のように呼び出すことができる他のオブジェクトについては、関数オブジェクトをご覧ください。

source: For information on how to construct an LCID, search www.microsoft.com for the following phrase:
ja: LCIDの構築方法については、www.microsoft.com、以下のフレーズで検索してください：

source: For information on how to construct an LCID, search www.microsoft.com for the following phrase: Locale Identifiers
ja: LCIDの構築方法については、www.microsoft.com、以下のフレーズで検索してください：Locale Identifiers

source: For instance, Finally blocks are not executed and __Delete is not called for objects contained by local variables.
ja: 例えば、ローカル変数に含まれるオブジェクトに対して、Finallyブロックは実行されず、__Deleteは呼び出されない。

source: For instance, literal text must be enclosed in quote marks (double " or single '), and the quote marks themselves aren't "seen" by the SendText function.
ja: 例えば、リテラルテキストは引用符（ダブル"またはシングル'」）で囲む必要があり、引用符そのものはSendText関数には「見えない」のです。

source: For instance, "new counter:" ++Counter is probably supposed to increment and display Counter, but technically it is invalid addition and unary plus.
ja: 例えば、"new counter:" ++Counterは、おそらくCounterをインクリメントして表示するものと思われますが、厳密には無効な加算と 単項式プラスになります。

source: For instance, "new counter:" ++counter is probably supposed to increment and display counter, but technically it is invalid addition and unary plus.
ja: 例えば、"new counter:" ++counterは、おそらくcounterをインクリメントして表示するものと思われますが、厳密には無効な加算と 単項式プラスになります。

source: For instance, xyz, is invalid in v2, so is assumed to be a valid v1 command.
ja: 例えば、xyz,はv2では無効なので、v1では有効なコマンドとみなされる。

source: For instance, GetKeyName("vk25") returns Left instead of NumpadLeft.
ja: 例えば、GetKeyName("vk25")は、NumpadLeftの代わりにLeftを返します。

source: For instance, {(a):
ja: 例えば、{(a):

source: For instance, {(a): b} or {an error: 1}.
ja: 例えば、{(a): b}または{an error: 1}。

source: For instance, Func.Prototype.Call is a single method which applies to all built-in and user-defined functions, and as such must accept any number of parameters.
ja: 例えば、Func.Prototype.Callは、すべての組み込み関数とユーザー定義関数に適用される単一のメソッドであり、そのため、任意の数のパラメータを受け入れる必要があります。

source: For instance, expr may refer to an outer function's local variables (as in any nested function), in which case a new closure is created and returned each time the fat arrow expression is evaluated.
ja: 例えば、exprは（入れ子になった関数のように）外側の関数のローカル変数を参照することがあり、その場合、ファット・アロー式が評価されるたびに新しいクロージャが作成され、返されます。

source: For instance, MyScript.exe automatically runs MyScript.ahk if a filename is not supplied, but is also capable of running other scripts.
ja: たとえば、MyScript.exeは、ファイル名が指定されなければ自動的にMyScript.ahkを実行するが、他のスクリプトを実行することもできる。

source: For instance, Ctrl+A produces text if the M option is used, and Esc produces the control character Chr(27).
ja: 例えば、Ctrl+AはMオプションを使用した場合、テキストを生成し、Escは制御文字Chr(27)を生成します。

source: For instance, JavaScript array objects and some other objects normally used with JavaScript expose array elements as properties.
ja: 例えば、JavaScriptの配列オブジェクトや、JavaScriptで通常使用される他のいくつかのオブジェクトは、配列要素をプロパティとして公開します。

source: For instance, WriteUInt returns 4 if successful.
ja: 例えば、WriteUIntは成功すれば4を返す。

source: For instance, a Buffer object can be assigned to a property or array element or be passed to or returned from a function without copying its contents.
ja: 例えば、Bufferオブジェクトはその内容をコピーすることなく、プロパティや配列要素に代入したり、関数に渡したり関数から返したりすることができる。

source: For instance, an expression that evaluates to a number was passed to a string (str) argument, a non-numeric string was passed to a numeric argument, or an object was passed to an argument not of type Ptr.
ja: 例えば、文字列（str）引数に数値として評価される式が渡された、数値引数に数値以外の文字列が渡された、Ptr型でない引数にオブジェクトが渡された、などです。

source: For instance, each hotkey is associated with a function to execute whenever the hotkey is pressed.
ja: 例えば、各ホットキーには、そのホットキーが押されたときに実行される関数が関連付けられています。

source: For instance, enabling per-monitor DPI awareness disables the scaling performed by the system, so built-in functions such as WinMove and WinGetPos will accept or return coordinates in pixels, untouched by DPI scaling.
ja: たとえば、モニターごとのDPI認識を有効にすると、システムによるスケーリングが無効になるため、WinMoveや WinGetPosなどの組み込み関数は、DPIスケーリングに影響されずにピクセル単位の座標を受け取ったり返したりします。

source: For instance, if x.child refers to y and y.parent refers to x, clearing x and y is not sufficient since the parent object still contains a reference to the child and vice versa.
ja: 例えば、x.childが yを参照し、y.parentが xを参照している場合、xと yをクリアするだけでは不十分である。

source: For instance, if Count is an expression with side-effects such as function calls or assignments, the side-effects occur only once.
ja: 例えば、Countが関数呼び出しや代入などの副作用を持つ式の場合、副作用は一度だけ発生します。

source: For instance, if Notepad isn't active while running the example above, Ctrl+A will perform its normal function (probably Select All).
ja: 例えば、上記の例の実行中にメモ帳がアクティブでない場合、Ctrl+Aは通常の機能（おそらく「すべて選択」）を実行します。

source: For instance, if WinWait finds a match before timing out, the result is non-zero.
ja: 例えば、WinWaitがタイムアウト前にマッチを見つけた場合、結果は非ゼロとなる。

source: For instance, if an interface pointer is returned, Release should not be called, but AddRef may be required depending on what the script does with the pointer.
ja: 例えば、インターフェイスポインタが返された場合、Releaseは呼び出すべきではありませんが、スクリプトがポインタをどうするかによって、AddRefが必要になることがあります。

source: For instance, if you are holding Ctrl and you call Send "Hi", Send will automatically release Ctrl before sending "Hi" and press it back down afterward.
ja: 例えば、Ctrlを押しながらSend "Hi"を呼ぶと、Sendは「Hi」を送信する前にCtrlを自動的に離し、送信後にCtrlを押し戻すようにします。

source: For instance, if you've got a new computer, it might have different drivers or other software installed.
ja: 例えば、パソコンを新しくした場合、ドライバーやその他のソフトウェアが異なるものがインストールされていることがあります。

source: For instance, in VBScript, MsgBox obj evaluates the object by invoking its default member.
ja: 例えば、VBScriptでは、MsgBox objは、そのデフォルトのメンバーを呼び出すことによって、オブジェクトを評価します。

source: For instance, in an expression, strings must be enclosed in quotation marks.
ja: 例えば、式の中では、文字列は引用符で囲む必要があります。

source: For instance, literal text, comments and variable names are displayed in different colours.
ja: 例えば、リテラル・テキスト、コメント、変数名は異なる色で表示される。

source: For instance, on an 11 inch 4K screen, a GUI designed to display at 96 dpi (100 %) would be almost impossible to use, whereas upscaling it by 200 % would make it usable.
ja: 例えば、11インチの4Kスクリーンでは、96dpi（100%）で表示するようにデザインされたGUIはほとんど使用不可能だが、200%アップスケールすれば使用可能になる。

source: For instance, one can improve or modify one section of code without having to know the details of other sections, and without having to make corresponding changes to those sections.
ja: 例えば、他のセクションの詳細を知ることなく、またそのセクションに対応する変更を加えることなく、コードのあるセクションを改良または修正することができます。

source: For instance, text is typically detected within Static and Button controls, but not Edit controls, unless they are owned by the script.
ja: 例えば、テキストは通常、静的コントロールとボタンコントロールの中で検出されるが、スクリプトによって所有されていない限り、編集コントロールは検出されない。

source: For instance, the hotstring ::btw:: can be triggered regardless of #InputLevel by sending btw at level 1 or higher and physically typing an ending character.
ja: 例えば、レベル1以上でbtwを送信し、終了文字を物理的に入力することで、#InputLevelに関係なくホットストリング::btw::をトリガーすることができます。

source: For instance, there are a number of problems with the example above:
ja: 例えば、上記の例には様々な問題があります：

source: For instance, to minimize a window instead of activating it, replace WinActivate with WinMinimize.
ja: 例えば、ウィンドウをアクティブにせずに最小化するには、WinActivateを WinMinimizeに置き換えます。

source: For instance, we might say "myArray is an array", but what we really mean is that myArray is a variable containing a reference to an array.
ja: 例えば、「myArrayは配列である」と言いますが、本当の意味は「myArrayは配列への参照を含む変数である」ということです。

source: For instance, when OnMessage is used to monitor input to a GUI window (such as in the WM_LBUTTONDOWN example), it is often more appropriate to allow the script to exit automatically when the last GUI window is closed.
ja: 例えば、OnMessageを使用してGUIウィンドウへの入力を監視する場合（WM_LBUTTONDOWNの例など）、最後のGUIウィンドウが閉じられたときにスクリプトが自動的に終了するようにする方が適切な場合があります。

source: For integers, 64-bit signed values are supported, which range from -9223372036854775808 (-0x8000000000000000) to 9223372036854775807 (0x7FFFFFFFFFFFFFFF).
ja: 整数の場合、64ビット符号付き値がサポートされ、その範囲は-9223372036854775808（-0x8000000000000000）から 9223372036854775807（0x7FFFFFFFFFFFFF）までである。

source: For integers, the minimum value and maximum value are both included in the set of possible numbers that may be returned.
ja: 整数のときは、最小値と最大値の両方が返される可能性のある数値の集合に含まれます。

source: For its icon, a GUI window uses the tray icon that was in effect at the time the window was created.
ja: GUIウィンドウのアイコンは、ウィンドウの作成時に有効だったトレイアイコンを使用します。

source: For keyboard keys and mouse buttons, this function returns 1 (true) if the key is down (or toggled on) or 0 (false) if it is up (or toggled off).
ja: キーボードキーとマウスボタンの場合、キーがダウン（またはトグルオン）している場合は1（真）、アップ（またはトグルオフ）している場合は0（偽）を返します。

source: For keys other than CapsLock, NumLock and ScrollLock, the toggle state is generally 0 when the script starts and is not synchronized between processes.
ja: CapsLock、NumLock、ScrollLock以外のキーについては、スクリプト起動時のトグル状態は一般に0であり、プロセス間で同期されることはない。

source: For loops, it is executed if the loop had zero iterations.
ja: For loops の場合は、ループの反復回数が0回だった場合に実行されます。

source: For messages which require a pointer to a string, use a Buffer or the StrPtr function.
ja: 文字列へのポインタが必要なメッセージには、BufferまたはStrPtr関数を使用します。

source: For modulo, see Mod.
ja: モジュロについてはModを参照。

source: For more about {Blind}, see Blind mode.
ja: {Blind}については、「ブラインドモード」を参照してください。

source: For more about hotkeys, see How to Write Hotkeys.
ja: ホットキーについて詳しくは、「ホットキーの書き方」を参照してください。

source: For more about running programs, see How to Run Programs.
ja: プログラムの実行については、「プログラムを実行する方法」をご覧ください。

source: For more advanced usage and details, see Reference Counting.
ja: より高度な使い方や詳細については、参照カウントを参照のこと。

source: For more details about each mode, see SendInput and SendPlay below.
ja: 各モードの詳細については、後述のSendInputおよびSendPlayを参照してください。

source: For more details of what these values mean, see Microsoft Docs:
ja: これらの値の意味の詳細については、Microsoft Docs：

source: For more details of what these values mean, see Microsoft Docs: CreateFont.
ja: これらの値の意味の詳細については、Microsoft Docs：CreateFontを参照してください。

source: For more details, see Alt-Tab.
ja: 詳しくは、「Alt-Tab」をご覧ください。

source: For more details, see Enable interaction with administrative programs on the archive forum.
ja: 詳しくは、アーカイブフォーラムの「管理プログラムとの相互作用を有効にする」をご覧ください。

source: For more details, see Enable interaction with administrative programs on the archived forum.
ja: 詳しくは、アーカイブフォーラムの「管理プログラムとの相互作用を有効にする」をご覧ください。

source: For more details, see Expressions; but be aware there is a lot of detail that you probably won't need to learn immediately.
ja: 詳しくは「式」をご覧ください。ただし、すぐに覚える必要のない内容も多いのでご注意ください。

source: For more details, see Interactive Debugging.
ja: 詳細はインタラクティブ・デバッグを参照。
